src/InformationRegisters/НастройкиПравДоступаПользователей/НастройкиПравДоступаПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПравДоступаПользователей</name>
  <resources>
    <name>Чтение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Запись</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ВидНаследованияПравДоступаИерархическихСправочников</name>
    <type>
      <types>EnumRef.ВидыНаследованияПравДоступаИерархическихСправочников</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектДоступа</name>
    <type>
      <types>CatalogRef.ГруппыДоступаКонтрагентов</types>
      <types>CatalogRef.ГруппыЗаявокКандидатов</types>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
      <types>CatalogRef.Проекты</types>
      <types>CatalogRef.ГруппыДоступаФизическихЛиц</types>
      <types>CatalogRef.ТипыЗаписейЗаметок</types>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.ВнешниеОбработки</types>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.НазначенияИспользованияСпецификаций</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОбъектаДоступа</name>
    <type>
      <types>EnumRef.ВидыОбъектовДоступа</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбластьДанных</name>
    <type>
      <types>EnumRef.ОбластиДанныхОбъектовДоступа</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.ГруппыПользователей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВладелецПравДоступа</name>
    <type>
      <types>CatalogRef.ГруппыДоступаКонтрагентов</types>
      <types>CatalogRef.ГруппыЗаявокКандидатов</types>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
      <types>CatalogRef.Проекты</types>
      <types>CatalogRef.ГруппыДоступаФизическихЛиц</types>
      <types>CatalogRef.ТипыЗаписейЗаметок</types>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.ВнешниеОбработки</types>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.НазначенияИспользованияСпецификаций</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НаследованаОтВсеПользователи</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/ГруппыПользователей/ГруппыПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыПользователей</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>ВсеПользователи</name>
      <description>Все пользователи</description>
    </items>
  </predefined>
  <tabularSections>
    <name>ПользователиГруппы</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/НастройкиПравДоступаПользователей/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	Для каждого ЗаписьНабора Из ЭтотОбъект Цикл
		Если НЕ ЗначениеЗаполнено(ЗаписьНабора.ВидОбъектаДоступа) Тогда
			ЗаписьНабора.ВидОбъектаДоступа = НастройкаПравДоступа.ПолучитьВидОбъектаДоступа(ЗаписьНабора.ОбъектДоступа);
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	#Если  Клиент Тогда
		ПроверитьКорректностьНазначенияГруппПользователям();
	#КонецЕсли
		
КонецПроцедуры

#Если  Клиент Тогда
Процедура ПроверитьКорректностьНазначенияГруппПользователям() Экспорт
		
	ГруппыВНаборе = ЭтотОбъект.ВыгрузитьКолонку("Пользователь");
	Если ГруппыВНаборе.Найти(Справочники.ГруппыПользователей.ВсеПользователи) <> Неопределено Тогда		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 1 ИЗ Справочник.ГруппыПользователей ГДЕ Ссылка <> ЗНАЧЕНИЕ(Справочник.ГруппыПользователей.ВсеПользователи)";
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			Предупреждение("Для корректного функционирования механизма ограничения прав доступа на уровне записей необходимо создать группы 
							|пользователей, для которых следует определить виды объектов доступа, по которым они ограничиваются. Настройки 
							|одной лишь группы «Все пользователи» недостаточно. Подробнее см. в документации.");
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры
#КонецЕсли
